import UIKit

//MARK: - 조건문
/*:
![Constants Syntax](conditional.png)
*/

/*:
### if-else 구문
 
*/


/* 기본 형태
 if 조건 {
     /* 실행 구문 */
 } else if 조건 {
     /* 실행 구문 */
 } else {
     /* 실행 구문 */
 }
*/


/*
 문제: 백스터는 오늘 시험에서 85점을 받았습니다. 이때 교수님이 정해준 성적 기준표에 맞는 백스터의 학점을 출력하세요.
 
 성적 기준표:
 90점 이상 A, 80점 이상 B, 70점 이상 C, 60점 이상 D, 나머지 F
 */


/*:
![Constants Syntax](반복문.png)
*/

/*:
### for-in문
*/

/* 기본 형태
 for 루프 상수 in 반복 대상 {
    실행 구문
 }
 */


/*
    문제: 과일 이름이 담긴 배열 내부의 과일 이름을 하나씩 출력하는 코드를 반복문을 이용해서 출력하시오.
*/
