import UIKit

//MARK: - 조건문
/*:
![Constants Syntax](conditional.png)
*/

/*:
### if-else 구문
 
*/


/* 기본 형태
 if 조건 {
     /* 실행 구문 */
 } else if 조건 {
     /* 실행 구문 */
 } else {
     /* 실행 구문 */
 }
*/


/*
 문제: 백스터는 오늘 시험에서 85점을 받았습니다. 이때 교수님이 정해준 성적 기준표에 맞는 백스터의 학점을 출력하세요.
 
 성적 기준표:
 90점 이상 A, 80점 이상 B, 70점 이상 C, 60점 이상 D, 나머지 F
 */



/*:
### switch 구문
*/



/* 기본 형태
switch 비교값 {
case 패턴:
    /* 실행 구문 */
default:
    /* 실행 구문 */
}
*/

/*:
![Constants Syntax](반복문.png)
*/

/*:
### for-in문
*/
//let fruits = ["사과", "바나나", "오렌지"]
//print(fruits)
//
//for name in fruits {
//    print(name)
//}
/*:
### while문
*/

/*
 문제: 비어있는 박스에 최대로 들어갈수 있는 맥북의 수량이 5개라고 했을때, 박스에 맥북을 최대로 넣는 코드를 반복문으로 작성해주세요.
 */


//1시간 10분 -> 55분으로 줄여야함. 변수 상수 + 데이터 타입 부분 대본 수정(매끄럽지가 X), ppt할때는 말빠르기 좀 더 빠르게 해야함.
